pelican_website/content/pages/page-part-one-04-variant-calling-genotyping.html
<html>
<head>
<meta name="Title" content="Variant calling and genotyping - Complete workflow" />
<meta name="Summary" content="Variant calling and genotyping" />
<meta name="URL" content="part-one-04-variant-calling-genotyping.html" />
<meta name="Save_as" content="part-one-04-variant-calling-genotyping.html" />
<meta name="Status" content="hidden" />
</head>
<body>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Variant calling and genotyping</a>
<ul>
<li><a href="#sec-1-1">Mapping back the reads to the consensus sequences</a>
<ul>
<li><a href="#sec-1-1-1"><span class="todo TODO">TODO</span> Examine Phred score profiles</a></li>
<li><a href="#sec-1-1-2"><span class="todo TODO">TODO</span> Read trimming</a></li>
</ul>
</li>
<li><a href="#sec-1-2">Variant calling</a>
<ul>
<li><a href="#sec-1-2-1"><span class="todo TODO">TODO</span> Prepare input files for Maq</a></li>
<li><a href="#sec-1-2-2"><span class="todo TODO">TODO</span> Read alignment to the consensus sequences</a></li>
<li><a href="#sec-1-2-3"><span class="todo TODO">TODO</span> SNP calling</a></li>
<li><a href="#sec-1-2-4">SNP filtering</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Summary plots for reality check</a>
<ul>
<li><a href="#sec-1-3-1"><span class="todo TODO">TODO</span> Have a look at the SNP files</a></li>
<li><a href="#sec-1-3-2"><span class="todo TODO">TODO</span> Count the number of SNP filtered</a></li>
<li><a href="#sec-1-3-3"><span class="todo TODO">TODO</span> Examine the coverage per population</a></li>
<li><a href="#sec-1-3-4"><span class="todo TODO">TODO</span> Compare ABB and BYN more thoroughly</a></li>
<li><a href="#sec-1-3-5"><span class="todo TODO">TODO</span> SNP coverage per habitat type and per water type</a></li>
</ul>
</li>
<li><a href="#sec-1-4">Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="outline-container-sec-1">
<h2 id="sec-1">Variant calling and genotyping</h2>
<div class="outline-text-2" id="text-1">
<p>
<div class="navLink"><a href="part-one-03-de-novo-assembly.html">Previous: De novo assembly</a></div>
</p>
</div>
<div class="outline-3" id="outline-container-sec-1-1">
<h3 id="sec-1-1">Mapping back the reads to the consensus sequences</h3>
<div class="outline-text-3" id="text-1-1">
</div><div class="outline-4" id="outline-container-sec-1-1-1">
<h4 id="sec-1-1-1"><span class="todo TODO">TODO</span> Examine Phred score profiles</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Now that we have the consensus sequences, we need to map back each read to them
to align matching reads together and detect polymorphic positions.
</p>
<p>
Read calling during sequencing is not perfect, and for Illumina the miscall
rate is around 1% (Nielsen et al. 2011). To minimise the errors during SNP
detection (false positives), we should process the reads to remove bases with
low quality score from the analysis.
</p>
<p>
Let's examine the distribution of quality scores for each set of reads. We can
use a homemade <a href="resources/extract_phred_profiles.py">python script</a> (<code>extract_phred_profiles.py</code>) to get the Phred
score in a tabular format. We can then use R to plot the average profiles.
</p>
<div class="org-src-container">
<pre class="src src-bash">python extract_phred_profiles.py s_6_2_sequence.fastq
</pre>
</div>
<div class="org-src-container">
<pre class="src src-R"># R script
#
# Plot the Phred profile for a FASTQ file
#----------------------------------------

p = read.table("s_6_2_sequence.fastq.phred_profile", sep = "\t", header = F)
boxplot(p, outline = F)
</pre>
</div>
<p>
How does the quality score change along the reads?
</p>
</div>
</div>
<div class="outline-4" id="outline-container-sec-1-1-2">
<h4 id="sec-1-1-2"><span class="todo TODO">TODO</span> Read trimming</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
To remove low quality bases from the 3' end, we will remove bases from this end
until the Phred quality score reached 20 (error rate = 1%). Remaining reads
with length less than 40 will be discarded.
</p>
<p>
We could do that using Fastq Quality trimmer as implemented in Galaxy tools,
but we can also use a homemade python script (<code>trim_reads.py</code>):
</p>
<div class="org-src-container">
<pre class="src src-bash"># Usage: python script.py inputFile phredThreshold lengthThreshold
python trim_reads.py s_6_2_sequence.fastq 20 40
</pre>
</div>
<p>
We apply the quality trimming to each forward and reverse reads files for each
population:
</p>
<div class="org-src-container">
<pre class="src src-bash">ls -1
</pre>
</div>
<pre class="example">
ABB.pair.for.fastq.clean
ABB.pair.rev.fastq.clean
BYN.pair.for.fastq.clean
BYN.pair.rev.fastq.clean
HKI.pair.for.fastq.clean
HKI.pair.rev.fastq.clean
LEV.pair.for.fastq.clean
LEV.pair.rev.fastq.clean
POR.pair.for.fastq.clean
POR.pair.rev.fastq.clean
PYO.pair.for.fastq.clean
PYO.pair.rev.fastq.clean
RYT.pair.for.fastq.clean
RYT.pair.rev.fastq.clean
SKA.pair.for.fastq.clean
SKA.pair.rev.fastq.clean
</pre>
<div class="org-src-container">
<pre class="src src-bash">python trim_reads.py *.fastq.clean 20 40
</pre>
</div>
<p>
Also apply this trimming to the files containing all the forward reads and all
the reverse reads used for the <i>de novo</i> assembly. How would you examine the
resulting distribution of read lengths in those trimmed files? If you have
time, do it.
</p>
</div>
</div>
</div>
<div class="outline-3" id="outline-container-sec-1-2">
<h3 id="sec-1-2">Variant calling</h3>
<div class="outline-text-3" id="text-1-2">
</div><div class="outline-4" id="outline-container-sec-1-2-1">
<h4 id="sec-1-2-1"><span class="todo TODO">TODO</span> Prepare input files for Maq</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
We will use the <code>Maq</code> program to perform the read alignment. A detailed
explanation of the Maq workflow is available <a href="http://maq.sourceforge.net/maq-man.shtml">here</a>.
</p>
<p>
We have the reference files:
</p>
<pre class="example">
consensus-for.fasta
consensus-rev.fasta
</pre>
<p>
and the reads files:
</p>
<pre class="example">
ABB.pair.for.fastq.clean.trimmed
ABB.pair.rev.fastq.clean.trimmed
BYN.pair.for.fastq.clean.trimmed
BYN.pair.rev.fastq.clean.trimmed
HKI.pair.for.fastq.clean.trimmed
HKI.pair.rev.fastq.clean.trimmed
LEV.pair.for.fastq.clean.trimmed
LEV.pair.rev.fastq.clean.trimmed
POR.pair.for.fastq.clean.trimmed
POR.pair.rev.fastq.clean.trimmed
PYO.pair.for.fastq.clean.trimmed
PYO.pair.rev.fastq.clean.trimmed
RYT.pair.for.fastq.clean.trimmed
RYT.pair.rev.fastq.clean.trimmed
SKA.pair.for.fastq.clean.trimmed
SKA.pair.rev.fastq.clean.trimmed
</pre>
<p>
First, we convert the fasta reference to Maq bfa format:
</p>
<div class="org-src-container">
<pre class="src src-bash">maq fasta2bfa consensus-for.fasta consensus-for.bfa
maq fasta2bfa consensus-rev.fasta consensus-rev.bfa
</pre>
</div>
<p>
Then we convert the fastq read files to Maq bfq format using a small bash
script, <code>convert-trimmed-to-bfq.sh</code>. The script file is:
</p>
<pre class="example">
#!/bin/bash
FILES=`ls *.trimmed`   # get the list of trimmed read files

for f in $FILES
do
  echo $f
  maq sol2sanger $f $f.sanger       # convert Illumina 1.5+ to Sanger scores
  maq fastq2bfq $f.sanger $f.bfq    # convert fastq to bfq
done
</pre>
<p>
We use it with:
</p>
<div class="org-src-container">
<pre class="src src-bash">bash convert-trimmed-to-bfq.sh
</pre>
</div>
<p>
We also generate the bfq files for all the concatenated forward reads and all
the concatenated reverse reads:
</p>
<div class="org-src-container">
<pre class="src src-bash"># Concatenate the forward and reverse reads
cat *for*.trimmed &gt; reads.for.trimmed
cat *rev*.trimmed &gt; reads.rev.trimmed
# Convert to bfq
maq sol2sanger reads.for.trimmed reads.for.sanger
maq sol2sanger reads.rev.trimmed reads.rev.sanger
maq fastq2bfq reads.for.sanger reads.for.bfq
maq fastq2bfq reads.rev.sanger reads.rev.bfq
</pre>
</div>
<p>
At this point, the fasta and fastq files have been converted to the binary
format used by Maq.
</p>
</div>
</div>
<div class="outline-4" id="outline-container-sec-1-2-2">
<h4 id="sec-1-2-2"><span class="todo TODO">TODO</span> Read alignment to the consensus sequences</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Here we will use all the forward reads and all the reverse reads and align them
to the consensus sequences. For the practicals, we work only with the forward
reads from now on.
</p>
<p>
Again, this step could be long, so we submit it as a job in the file
<code>map-maq-for-job</code>. The map file is a binary file, but we also convert it to a
human-readable form with <code>mapview</code>:
</p>
<pre class="example">
#!/bin/bash
#$ -S /bin/bash
#$ -M matthieu.bruneaux@ens-lyon.org
#$ -V
#$ -m bea
#$ -cwd
# Maq map forward reads
maq map for.map consensus-for.bfa reads.for.bfq
maq mapview for.map &gt; for.map.txt
</pre>
<p>
We submit the job with <code>qsub -q long.q map-maq-for-job</code>. Have a look at the map
with <code>less -S for.map.txt</code>. Using the <a href="http://maq.sourceforge.net/maq-manpage.shtml">man page</a> (search for "mapview" with
CTRL+F), understand the output format, and in particular look for the number of
mismatches of the best hits. Can you identify which reads are similar to the
consensus sequence and which harbour potential SNPs?
</p>
</div>
</div>
