page-part-one-04-variant-calling-genotyping.org
*** TODO SNP calling

Now that the reads have been mapped back, we can perform the SNP calling
operation.

We use the =assemble= and the =cns2snp= function of Maq to extract the SNP
information. The job file is =maq-assemble-cns2snp-job=:
#+BEGIN_SRC 
#!/bin/bash
#$ -S /bin/bash
#$ -M matthieu.bruneaux@ens-lyon.org
#$ -V
#$ -m bea
#$ -cwd
# Maq assemble
maq assemble for.cns consensus-for.bfa for.map 2> for-assemble.log
# Maq cns2snp
maq cns2snp for.cns > for.snp
#+END_SRC

As usual, we submit the job with =qsub -q long.q
map-assemble-cns2snp-job=. Have a look at the output file =for.snp=. How many
putative SNPs were detected? The format of the output file is explained on the
[[http://maq.sourceforge.net/maq-manpage.shtml][man page]] (search for "cns2snp" with CTRL+F).

A very useful file for detailed SNP filtering is the pileup file. We can
produce it with:
#+BEGIN_SRC bash
maq pileup consensus-for.bfa for.map > for.pileup
#+END_SRC

Have a look at the pileup file with =less -S for.pileup=. Can you understand
its format? (see the [[http://maq.sourceforge.net/maq-manpage.shtml][man page]], search for "pileup") Can you identify the
contigs with low coverage and high coverage? Can you identify putative
polymorphic positions? Can you identify positions that look like genuine SNPs?

*** SNP filtering

The SNP filtering is a delicate operation, since it is important to make a
distinction between genuine SNPs and false positives due to sequencing
errors. In this case, we used the following criteria:
- alleles with a frequency equal to or less than the error rate (i.e. <=0.01)
  were removed
- retained SNP should be biallelic
- read depth (coverage) should be greater than 10 but less than 1000
- at least 3 reads should be observed per SNP allele
- maximum two SNPs per consensus sequence
- not falling less than 5 bases away from identified microsatellites (if
  microsatellites were kept)

Those criteria are rather on the conservative side and might result in losing
genuine SNPs. Explain why and propose better criteria.

Some SNP calling methods use more elaborate approaches such as maximum
likelihood and bayesian methods. See the *bibliography notes* section.

Since the SNP filtering as done here is mainly an exercise in scripting (using
R or Python for example), we will not perform it during the practicals and we
will use ready-made output files containing the SNP information.

** Summary plots for reality check

We give you a list of SNP summary files, with information about coverage and
allele frequency in the full dataset (=Total=) and per populations, per habitat
or per water type (freshwater vs marine).
#+BEGIN_SRC 
ls -1
#+END_SRC
#+BEGIN_SRC 
0_Ninesp_020212_Final_SNPs_Totals.txt
1_Ninesp_020212_Final_SNPs_Populations_Stacked.txt
1_Ninesp_020212_Final_SNPs_Totals_and_Populations_Horizontal.txt
2_Ninesp_020212_Final_SNPs_Totals_and_Habitats_Horizontal.txt
2_Ninesp_020212_Final_SNPs_Totals_and_Habitats_Stacked.txt
3_Ninesp_020212_Final_SNPs_Totals_and_Waters_Horizontal.txt
3_Ninesp_020212_Final_SNPs_Totals_and_Waters_Stacked.txt
#+END_SRC

=Stacked= and =Horizontal= correspond to different ways of organizing the data
in the table, but the information is the same.

*** TODO Have a look at the SNP files

Look at the SNP files with, for example:
#+BEGIN_SRC 
column -t 0_Ninesp_020212_Final_SNPs_Totals.txt | less -S
#+END_SRC
Here, we use the =colum= command to produce a nice, human-readable display of
the tabular file, and we send it through a pipe to =less= for easy navigation
through the file.

Have a look to a few different files. Can you understand what the different
columns stand for? Can you see the difference between a =Stacked= file and a
=Horizontal= file?

*** TODO Count the number of SNP filtered

Count the number of SNP which were filtered and kept:
#+BEGIN_SRC bash
wc -l 0_Ninesp_020212_Final_SNPs_Totals.txt
#+END_SRC
Note that the header line is also counted here.

How many SNP do we have? How many consensus sequences did we have initially?
What is the approximate proportion of consensus sequences with a SNP?

Actually there are several SNP types: some are single SNPs on the consensus
sequence, some are associated into haplotypes of several SNPs on the same
sequence. Let's count how many SNPs of each type we have:
#+BEGIN_SRC bash
cut -f 13 0_Ninesp_020212_Final_SNPs_Totals.txt | sort | uniq -c
#+END_SRC
We use =cut= to extract the column 13 of the file (which contains the SNP type
information) and pipe it to =sort= and =uniq -c= to count the number of
occurrences of the different entries.

*** TODO Examine the coverage per population

When we looked at the number of reads per population, we noticed that there
were large discrepancies between populations. Let's have a look at how the
coverage per SNP per population compares.
#+BEGIN_SRC 
# R script

# Compare the distribution of SNP coverage between populations
#-------------------------------------------------------------

# Load the data
d = read.table("1_Ninesp_020212_Final_SNPs_Populations_Stacked.txt", header = T,
      stringsAsFactors = F)

# Get the columns names
names(d)

# Store the habitat types per population
pop = c("ABB", "BYN", "HKI", "LEV", "POR", "PYO", "RYT", "SKA")
habitat = c("Pond", "Pond", "Marine", "Marine", "Lake", "Pond", "Pond", "Lake")
habColors = c("green", "green", "red", "red", "grey", "green", "green", "grey")

# Boxplot of SNP coverage
boxplot(d2$AlignDepth ~ d2$Population, col = habColors)
# note: the colors match because boxplot sorts the population alphabetically

# Remove outliers display
boxplot(d2$AlignDepth ~ d2$Population, col = habColors, outline = F)

# As a comparison, we will plot again the read distribution per population

popReads = c("BYN", "RYT", "HKI", "PYO", "ABB", "SKA", "LEV", "POR")
habitatReads = c("Pond", "Pond", "Marine", "Pond", "Pond", "Lake", "Marine", "Lake")
habColReads = c("green", "green", "red", "green", "green", "grey", "red", "grey")
n_pairs = c(175685, 577420, 446765, 652455, 396861, 78983, 361187, 321539)

# Sort the data alphabetically
n_pairs = n_pairs[order(popReads)]
habColReads = habColReads[order(popReads)]
popReads = popReasd[order(popReads)]

# Barplot
barplot(n_pairs, names.arg = popReads, col = habColReads, ylab = "N pairs", las = 1)

# The two plots together for easier comparison
par(mfrow = c(2, 1), mar = c(2.5, 4, 1, 1))
boxplot(d2$AlignDepth ~ d2$Population, col = habColors, outline = F, las = 1, 
  ylab = "Coverage")
barplot(n_pairs, names.arg = popReads, col = habColReads, ylab = "N pairs", las = 1)
#+END_SRC

Is the coverage homogeneous between populations? What is your feeling about
estimating allele frequencies per population based on those coverage?

How do the numbers of pairs per population and the SNP coverage compare? Can
you explain the differences?

