pelican_website/content/pages/page-part-one-04-variant-calling-genotyping.html
<div class="outline-4" id="outline-container-sec-1-2-3">
<h4 id="sec-1-2-3"><span class="todo TODO">TODO</span> SNP calling</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Now that the reads have been mapped back, we can perform the SNP calling
operation.
</p>
<p>
We use the <code>assemble</code> and the <code>cns2snp</code> function of Maq to extract the SNP
information. The job file is <code>maq-assemble-cns2snp-job</code>:
</p>
<pre class="example">
#!/bin/bash
#$ -S /bin/bash
#$ -M matthieu.bruneaux@ens-lyon.org
#$ -V
#$ -m bea
#$ -cwd
# Maq assemble
maq assemble for.cns consensus-for.bfa for.map 2&gt; for-assemble.log
# Maq cns2snp
maq cns2snp for.cns &gt; for.snp
</pre>
<p>
As usual, we submit the job with <code>qsub -q long.q
map-assemble-cns2snp-job</code>. Have a look at the output file <code>for.snp</code>. How many
putative SNPs were detected? The format of the output file is explained on the
<a href="http://maq.sourceforge.net/maq-manpage.shtml">man page</a> (search for "cns2snp" with CTRL+F).
</p>
<p>
A very useful file for detailed SNP filtering is the pileup file. We can
produce it with:
</p>
<div class="org-src-container">
<pre class="src src-bash">maq pileup consensus-for.bfa for.map &gt; for.pileup
</pre>
</div>
<p>
Have a look at the pileup file with <code>less -S for.pileup</code>. Can you understand
its format? (see the <a href="http://maq.sourceforge.net/maq-manpage.shtml">man page</a>, search for "pileup") Can you identify the
contigs with low coverage and high coverage? Can you identify putative
polymorphic positions? Can you identify positions that look like genuine SNPs?
</p>
</div>
</div>
<div class="outline-4" id="outline-container-sec-1-2-4">
<h4 id="sec-1-2-4">SNP filtering</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
The SNP filtering is a delicate operation, since it is important to make a
distinction between genuine SNPs and false positives due to sequencing
errors. In this case, we used the following criteria:
</p>
<ul class="org-ul">
<li>alleles with a frequency equal to or less than the error rate (i.e. &lt;=0.01)
were removed
</li>
<li>retained SNP should be biallelic
</li>
<li>read depth (coverage) should be greater than 10 but less than 1000
</li>
<li>at least 3 reads should be observed per SNP allele
</li>
<li>maximum two SNPs per consensus sequence
</li>
<li>not falling less than 5 bases away from identified microsatellites (if
microsatellites were kept)
</li>
</ul>
<p>
Those criteria are rather on the conservative side and might result in losing
genuine SNPs. Explain why and propose better criteria.
</p>
<p>
Some SNP calling methods use more elaborate approaches such as maximum
likelihood and bayesian methods. See the <b>bibliography notes</b> section.
</p>
<p>
Since the SNP filtering as done here is mainly an exercise in scripting (using
R or Python for example), we will not perform it during the practicals and we
will use ready-made output files containing the SNP information.
</p>
</div>
</div>
</div>
<div class="outline-3" id="outline-container-sec-1-3">
<h3 id="sec-1-3">Summary plots for reality check</h3>
<div class="outline-text-3" id="text-1-3">
<p>
We give you a list of SNP summary files, with information about coverage and
allele frequency in the full dataset (<code>Total</code>) and per populations, per habitat
or per water type (freshwater vs marine).
</p>
<pre class="example">
ls -1
</pre>
<pre class="example">
0_Ninesp_020212_Final_SNPs_Totals.txt
1_Ninesp_020212_Final_SNPs_Populations_Stacked.txt
1_Ninesp_020212_Final_SNPs_Totals_and_Populations_Horizontal.txt
2_Ninesp_020212_Final_SNPs_Totals_and_Habitats_Horizontal.txt
2_Ninesp_020212_Final_SNPs_Totals_and_Habitats_Stacked.txt
3_Ninesp_020212_Final_SNPs_Totals_and_Waters_Horizontal.txt
3_Ninesp_020212_Final_SNPs_Totals_and_Waters_Stacked.txt
</pre>
<p>
<code>Stacked</code> and <code>Horizontal</code> correspond to different ways of organizing the data
in the table, but the information is the same.
</p>
</div>
<div class="outline-4" id="outline-container-sec-1-3-1">
<h4 id="sec-1-3-1"><span class="todo TODO">TODO</span> Have a look at the SNP files</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Look at the SNP files with, for example:
</p>
<pre class="example">
column -t 0_Ninesp_020212_Final_SNPs_Totals.txt | less -S
</pre>
<p>
Here, we use the <code>colum</code> command to produce a nice, human-readable display of
the tabular file, and we send it through a pipe to <code>less</code> for easy navigation
through the file.
</p>
<p>
Have a look to a few different files. Can you understand what the different
columns stand for? Can you see the difference between a <code>Stacked</code> file and a
<code>Horizontal</code> file?
</p>
</div>
</div>
<div class="outline-4" id="outline-container-sec-1-3-2">
<h4 id="sec-1-3-2"><span class="todo TODO">TODO</span> Count the number of SNP filtered</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Count the number of SNP which were filtered and kept:
</p>
<div class="org-src-container">
<pre class="src src-bash">wc -l 0_Ninesp_020212_Final_SNPs_Totals.txt
</pre>
</div>
<p>
Note that the header line is also counted here.
</p>
<p>
How many SNP do we have? How many consensus sequences did we have initially?
What is the approximate proportion of consensus sequences with a SNP?
</p>
<p>
Actually there are several SNP types: some are single SNPs on the consensus
sequence, some are associated into haplotypes of several SNPs on the same
sequence. Let's count how many SNPs of each type we have:
</p>
<div class="org-src-container">
<pre class="src src-bash">cut -f 13 0_Ninesp_020212_Final_SNPs_Totals.txt | sort | uniq -c
</pre>
</div>
<p>
We use <code>cut</code> to extract the column 13 of the file (which contains the SNP type
information) and pipe it to <code>sort</code> and <code>uniq -c</code> to count the number of
occurrences of the different entries.
</p>
</div>
</div>
<div class="outline-4" id="outline-container-sec-1-3-3">
<h4 id="sec-1-3-3"><span class="todo TODO">TODO</span> Examine the coverage per population</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
When we looked at the number of reads per population, we noticed that there
were large discrepancies between populations. Let's have a look at how the
coverage per SNP per population compares.
</p>
<pre class="example">
# R script

# Compare the distribution of SNP coverage between populations
#-------------------------------------------------------------

# Load the data
d = read.table("1_Ninesp_020212_Final_SNPs_Populations_Stacked.txt", header = T,
      stringsAsFactors = F)
# Get the columns names
names(d)
# Store the habitat types per population
pop = c("ABB", "BYN", "HKI", "LEV", "POR", "PYO", "RYT", "SKA")
habitat = c("Pond", "Pond", "Marine", "Marine", "Lake", "Pond", "Pond", "Lake")
habColors = c("green", "green", "red", "red", "grey", "green", "green", "grey")

# Boxplot of SNP coverage
boxplot(d2$AlignDepth ~ d2$Population, col = habColors)
# note: the colors match because boxplot sorts the population alphabetically

# Remove outliers display
boxplot(d2$AlignDepth ~ d2$Population, col = habColors, outline = F)

# As a comparison, plot again the read distribution per population

popReads = c("BYN", "RYT", "HKI", "PYO", "ABB", "SKA", "LEV", "POR")
habitatReads = c("Pond", "Pond", "Marine", "Pond", "Pond", "Lake", "Marine", "Lake")
habColReads = c("green", "green", "red", "green", "green", "grey", "red", "grey")
n_pairs = c(175685, 577420, 446765, 652455, 396861, 78983, 361187, 321539)
# Sort the data alphabetically
n_pairs = n_pairs[order(popReads)]
habColReads = habColReads[order(popReads)]
popReads = popReasd[order(popReads)]
barplot(n_pairs, names.arg = popReads, col = habColReads, ylab = "N pairs", las = 1)

# Two plots together
par(mfrow = c(2, 1), mar = c(2.5, 4, 1, 1))
boxplot(d2$AlignDepth ~ d2$Population, col = habColors, outline = F, las = 1, 
  ylab = "Coverage")
barplot(n_pairs, names.arg = popReads, col = habColReads, ylab = "N pairs", las = 1)
</pre>
<p>
Is the coverage homogeneous between populations? What is your feeling about
estimating allele frequencies per population based on those coverage?
</p>
<p>
How do the numbers of pairs per population and the SNP coverage compare? Can
you explain the differences?
</p>
</div>
</div>
