page-part-one-04-variant-calling-genotyping.org
*** TODO Compare ABB and BYN more thoroughly

Let's have a closer look at ABB and BYN:
#+BEGIN_SRC 
# R script

# Load the data
d = read.table("1_Ninesp_020212_Final_SNPs_Populations_Stacked.txt", header = T,
      stringsAsFactors = F)

# Get the data for ABB and BYN
d_ABB = subset(d, d$Population == "ABB")
d_BYN = subset(d, d$Population == "BYN")

# Look at the count of SNP per AlignDepth
table(d_ABB$AlignDepth)
table(d_BYN$AlignDepth)

# Plots
par(mfrow = c(2, 1), mar = c(2.5, 4, 1, 1))
plot(table(d_ABB$AlignDepth))
plot(table(d_BYN$AlignDepth))

# Same xlim
plot(table(d_ABB$AlignDepth), xlim = c(0, 650))
plot(table(d_BYN$AlignDepth), xlim = c(0, 650))
#+END_SRC

Can you now explain why ABB and BYN differ in their comparison if we consider
read pairs or SNP coverage?

*** TODO SNP coverage per habitat type and per water type

We will have to pool our populations together by habitat type or by water type
(freshwater vs marine) if we want to improve a bit allele frequency
estimates. Note that this approach is far from perfect! Populations are
different, and different demographic histories and evolutionary trajectories
means that we might be pooling things which are different in essence and that
our allele frequency estimates might have little meaning. However, since we are
basically looking for signals of parallel evolution in one water type vs
another, we can hope that, if such parallel evolution occurred for some
markers, we might be able to recover some meaningful information when averaging
the values during the genome scan step.

Let's have a look at coverage when we pool the data per habitat type:
#+BEGIN_SRC 
# R script

# Load the data
d = read.table("2_Ninesp_020212_Final_SNPs_Totals_and_Habitats_Stacked.txt", header = T)
head(d)

# Boxplot
dev.off() # To have only one plot displayed again
boxplot(d$AlignDepth ~ d$HabitatType, col = c("grey", "red", "green"),
  ylab = "Coverage", las = 1)

# Remove outliers
boxplot(d$AlignDepth ~ d$HabitatType, col = c("grey", "red", "green"),
  ylab = "Coverage", las = 1, outline = F)
#+END_SRC

How do the coverages per habitat type compare?

In the end we will pool the data by water type. Let's look at the coverages in
more details:
#+BEGIN_SRC 
# R script

# Load the data pooled by water type
d = read.table("3_Ninesp_020212_Final_SNPs_Totals_and_Waters_Stacked.txt", header = T)

# Boxplot
boxplot(d$AlginDepth ~ d$WaterType, ylab = "Coverage", las = 1)
boxplot(d$AlginDepth ~ d$WaterType, ylab = "Coverage", las = 1, outline = F)

# Load the data in the horizontal format
d2 = read.table("3_Ninesp_020212_Final_SNPs_Totals_and_Waters_Horizontal.txt", header = T)

# Plot the relation between coverage in marine populations and in freshwater populations
plot(d2$Marine_AlignDepth, d2$Freshwater_AlignDepth, xlab = "Marine coverage",
  ylab = "Freshwater coverage", pch = 16, col = rgb(0, 0, 1, 0.2))

# Use log scale (note that we had 1 to all values to see also the zeros)
plot(d2$Marine_AlignDepth + 1, d2$Freshwater_AlignDepth + 1, xlab = "Marine coverage + 1",
  ylab = "Freshwater coverage + 1", pch = 16, col = rgb(0, 0, 1, 0.2), log = "xy")

# Add a bit of jittering to reduce points overlap
plot(jitter(d2$Marine_AlignDepth + 1), d2$Freshwater_AlignDepth + 1, xlab = "Marine coverage + 1",
  ylab = "Freshwater coverage + 1", pch = 16, col = rgb(0, 0, 1, 0.2), log = "xy")
#+END_SRC

We can also compare the number of fixed alleles in each water type. Questions
are embedded in the following code:
#+BEGIN_SRC 
# R script

# Load the data in the horizontal format
d2 = read.table("3_Ninesp_020212_Final_SNPs_Totals_and_Waters_Horizontal.txt", header = T)

# Compare the allele frequencies
plot(d2$Marine_snpfreq1, d2$Freshwater_snpfreq1, xlab = "Marine freq", 
  ylab = "Freshwater freq", pch = 16, color = rgb(0, 0, 1, 0.2))

# *Q*: Can you see the fixed alleles in the freshwater habitats? In the marine
# habitats?

# Another view of the same data
smoothScatter(d2$Marine_snpfreq1, d2$Freshwater_snpfreq1, xlab = "Marine freq", 
  ylab = "Freshwater freq")

# *Q*: In the density scatter plot, compare the frequencies of alleles fixed in
# the marine populations with the frequencies in the freshwater populations.

# Let's count the number of fixed alleles in each water type
sum(d2$Marine_snpfreq1 == 0 | d2$Marine_snpfreq1 == 1, na.rm = T)
sum(d2$Freshwater_snpfreq1 == 0 | d2$Freshwater_snpfreq1 == 1, na.rm = T)

# *Q*: Is this what you expected? If not, how can you explain it?
#+END_SRC

** Next steps

We now have the consensus sequences, a list of variants on those sequences and
some estimates of their allele frequencies in the different water types. The
more technical part concerning the processing of raw RAD-seq data into genetic
data of interest is now complete, and we can proceed to the downstream
analyses.

@@html:<div class="navLink">@@[[file:part-one-05-downstream-analysis.html][Next: Downstream analysis]]@@html:</div>@@
